Revit 2027 API
RevitLinkGraphicsSettings.IsViewRangeSupported Method
 Returns true if the input view supports ViewRange settings of RevitLinkGraphicsSettings, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsViewRangeSupported(
	View view
)
Public Shared Function IsViewRangeSupported (
	view As View
) As Boolean
public:
static bool IsViewRangeSupported(
	View^ view
)
static member IsViewRangeSupported :
        view : View -> bool
Parameters
view View
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace